schreibfaul1/ESP32-audioI2S/src/Audio.h
/*
 * Audio.h
 *
 */

// #define SR_48K

#pragma once
#pragma GCC optimize("Ofast")
#include "audiolib_structs.hpp"
#include "esp_arduino_version.h"
#include "psram_unique_ptr.hpp"
#include <Arduino.h>
#include <FFat.h>
#include <FS.h>
#include <NetworkClient.h>
#include <NetworkClientSecure.h>
#include <SD.h>
#include <SD_MMC.h>
#include <WiFi.h>
#include <atomic>
#include <charconv>
#include <codecvt>
#include <deque>
#include <driver/i2s_std.h>
#include <esp32-hal-log.h>
#include <functional>
#include <libb64/cencode.h>
#include <locale>
#include <memory>
#include <vector>

#ifndef I2S_GPIO_UNUSED
    #define I2S_GPIO_UNUSED -1 // = I2S_PIN_NO_CHANGE in IDF < 5
#endif

extern __attribute__((weak)) void audio_process_i2s(int16_t* outBuff, int32_t validSamples, bool* continueI2S); // record audiodata or send via BT
extern char                       audioI2SVers[];
class Decoder; // prototype

// Audio event type descriptions
static constexpr std::array<const char*, 13> eventStr = {"info",    "id3data",  "eof",      "station_name", "icy_description", "streamtitle", "bitrate",
                                                         "icy_url", "icy_logo", "lasthost", "cover_image",  "lyrics",          "log"};
//----------------------------------------------------------------------------------------------------------------------

class AudioBuffer {
    // AudioBuffer will be allocated in PSRAM
    //
    //  m_buffer            m_readPtr                 m_writePtr                 m_endPtr
    //   |                       |<------dataLength------->|<------ writeSpace ----->|
    //   ▼                       ▼                         ▼                         ▼
    //   ---------------------------------------------------------------------------------------------------------------
    //   |                     <--m_buffSize-->                                      |      <--m_resBuffSize -->     |
    //   ---------------------------------------------------------------------------------------------------------------
    //   |<-----freeSpace------->|                         |<------freeSpace-------->|
    //
    //
    //
    //   if the space between m_readPtr and buffend < m_resBuffSize copy data from the beginning to resBuff
    //   so that the mp3/aac/flac frame is always completed
    //
    //  m_buffer                      m_writePtr                 m_readPtr        m_endPtr
    //   |                                 |<-------writeSpace------>|<--dataLength-->|
    //   ▼                                 ▼                         ▼                ▼
    //   ---------------------------------------------------------------------------------------------------------------
    //   |                        <--m_buffSize-->                                    |      <--m_resBuffSize -->     |
    //   ---------------------------------------------------------------------------------------------------------------
    //   |<---  ------dataLength--  ------>|<-------freeSpace------->|
    //
    //

  public:
    AudioBuffer(size_t maxBlockSize = 0); // constructor
    ~AudioBuffer();                       // frees the buffer
    size_t   init();                      // set default values
    bool     isInitialized() { return m_f_init; };
    int32_t  getBufsize();
    bool     setBufsize(size_t mbs);           // default is m_buffSizePSRAM for psram, and m_buffSizeRAM without psram
    void     changeMaxBlockSize(uint32_t mbs); // is default 1600 for mp3 and aac, set 16384 for FLAC
    uint32_t getMaxBlockSize();                // returns maxBlockSize
    size_t   freeSpace();                      // number of free bytes to overwrite
    size_t   writeSpace();                     // space fom writepointer to bufferend
    size_t   bufferFilled();                   // returns the number of filled bytes
    size_t   getMaxAvailableBytes();           // max readable bytes in one block
    void     bytesWritten(size_t bw);          // update writepointer
    void     bytesWasRead(size_t br);          // update readpointer
    uint8_t* getWritePtr();                    // returns the current writepointer
    uint8_t* getReadPtr();                     // returns the current readpointer
    uint32_t getWritePos();                    // write position relative to the beginning
    uint32_t getReadPos();                     // read position relative to the beginning
    void     resetBuffer();                    // restore defaults

  protected:
    size_t          m_buffSize = UINT16_MAX * 10; // most webstreams limit the advance to 100...300Kbytes
    size_t          m_freeSpace = 0;
    size_t          m_writeSpace = 0;
    size_t          m_dataLength = 0;
    size_t          m_resBuffSize = UINT16_MAX; // reserved buffspace, >= one flac frame
    size_t          m_maxBlockSize = 1600;
    ps_ptr<uint8_t> m_buffer;
    uint8_t*        m_writePtr = NULL;
    uint8_t*        m_readPtr = NULL;
    uint8_t*        m_endPtr = NULL;
    bool            m_f_init = false;
    bool            m_f_isEmpty = true;
};
//----------------------------------------------------------------------------------------------------------------------

class Audio {
  private:
    AudioBuffer InBuff;    // instance of input buffer
    uint8_t     m_i2s_num; // I2S_NUM_0 or I2S_NUM_1

  public:
    Audio(uint8_t i2sPort = I2S_NUM_0);
    ~Audio();
    std::mutex mutex_info; // mutex_info as member

    // callbacks ---------------------------------------------------------
    typedef enum { evt_info = 0, evt_id3data, evt_eof, evt_name, evt_icydescription, evt_streamtitle, evt_bitrate, evt_icyurl, evt_icylogo, evt_lasthost, evt_image, evt_lyrics, evt_log } event_t;
    typedef struct _msg { // used in info(audio_info_callback());
        const char*           msg = nullptr;
        const char*           s = nullptr;
        event_t               e = (event_t)0; // event type
        uint8_t               i2s_num = 0;
        int32_t               arg1 = 0;
        int32_t               arg2 = 0;
        std::vector<uint32_t> vec = {}; // apic [pos, len, pos, len, pos, len, ....]
    } msg_t;
    inline static std::function<void(msg_t i)> audio_info_callback;
    // -------------------------------------------------------------------

