schreibfaul1/ESP32-audioI2S/src/Audio.h
  private:
    void        startAudioTask(); // starts a task for decode and play
    void        stopAudioTask();  // stops task for audio
    static void taskWrapper(void* param);
    void        audioTask();
    void        performAudioTask();

    //+++ H E L P   F U N C T I O N S +++
    bool         readMetadata(uint16_t b, uint16_t* readedBytes, bool first = false);
    int32_t      getChunkSize(uint16_t* readedBytes, bool first = false);
    bool         readID3V1Tag();
    int32_t      newInBuffStart(int32_t m_resumeFilePos);
    boolean      streamDetection(uint32_t bytesAvail);
    uint32_t     m4a_correctResumeFilePos();
    uint32_t     ogg_correctResumeFilePos();
    int32_t      flac_correctResumeFilePos();
    int32_t      mp3_correctResumeFilePos();
    uint8_t      determineOggCodec();
    void         strlower(char* str);
    void         trim(char* str);
    bool         startsWith(const char* base, const char* str);
    bool         endsWith(const char* base, const char* searchString);
    int          indexOf(const char* base, const char* str, int startIndex = 0);
    int          indexOf(const char* base, char ch, int startIndex = 0);
    int          lastIndexOf(const char* haystack, const char* needle);
    int          lastIndexOf(const char* haystack, const char needle);
    int          specialIndexOf(uint8_t* base, const char* str, int baselen, bool exact = false);
    int          specialIndexOfLast(uint8_t* base, const char* str, int baselen);
    int          find_utf16_null_terminator(const uint8_t* buf, int start, int max);
    int32_t      min3(int32_t a, int32_t b, int32_t c);
    uint64_t     bigEndian(uint8_t* base, uint8_t numBytes, uint8_t shiftLeft = 8);
    bool         b64encode(const char* source, uint16_t sourceLength, char* dest);
    void         vector_clear_and_shrink(std::vector<ps_ptr<char>>& vec);
    void         deque_clear_and_shrink(std::deque<ps_ptr<char>>& deq);
    uint32_t     simpleHash(const char* str);
    ps_ptr<char> urlencode(const char* str, bool spacesOnly);
    uint32_t     bswap32(uint32_t x);
    uint64_t     bswap64(uint64_t x);

  private:
    enum : int { APLL_AUTO = -1, APLL_ENABLE = 1, APLL_DISABLE = 0 };
    enum : int { EXTERNAL_I2S = 0, INTERNAL_DAC = 1, INTERNAL_PDM = 2 };
    enum : int { FORMAT_NONE = 0, FORMAT_M3U = 1, FORMAT_PLS = 2, FORMAT_ASX = 3, FORMAT_M3U8 = 4 }; // playlist formats
    const char* plsFmtStr[5] = {"NONE", "M3U", "PLS", "ASX", "M3U8"};                                // playlist format string
    enum : int { AUDIO_NONE, HTTP_RESPONSE_HEADER, HTTP_RANGE_HEADER, AUDIO_DATA, AUDIO_LOCALFILE, AUDIO_PLAYLISTINIT, AUDIO_PLAYLISTHEADER, AUDIO_PLAYLISTDATA };
    const char* dataModeStr[8] = {"AUDIO_NONE", "HTTP_RESPONSE_HEADER", "HTTP_RANGE_HEADER", "AUDIO_DATA", "AUDIO_LOCALFILE", "AUDIO_PLAYLISTINIT", "AUDIO_PLAYLISTHEADER", "AUDIO_PLAYLISTDATA"};
    enum : int { FLAC_BEGIN = 0, FLAC_MAGIC = 1, FLAC_MBH = 2, FLAC_SINFO = 3, FLAC_PADDING = 4, FLAC_APP = 5, FLAC_SEEK = 6, FLAC_VORBIS = 7, FLAC_CUESHEET = 8, FLAC_PICTURE = 9, FLAC_OKAY = 100 };
    enum : int {
        M4A_BEGIN = 0,
        M4A_FTYP = 1,
        M4A_CHK = 2,
        M4A_MOOV = 3,
        M4A_FREE = 4,
        M4A_TRAK = 5,
        M4A_MDAT = 6,
        M4A_ILST = 7,
        M4A_MP4A = 8,
        M4A_ESDS = 9,
        M4A_MDIA = 10,
        M4A_MINF = 11,
        M4A_STBL = 12,
        M4A_STSD = 13,
        M4A_UDTA = 14,
        M4A_STSZ = 15,
        M4A_META = 16,
        M4A_MDHD = 17,
        M4A_AMRDY = 99,
        M4A_OKAY = 100,
    };
    enum : int { CODEC_NONE = 0, CODEC_WAV = 1, CODEC_MP3 = 2, CODEC_AAC = 3, CODEC_M4A = 4, CODEC_FLAC = 5, CODEC_AACP = 6, CODEC_OPUS = 7, CODEC_OGG = 8, CODEC_VORBIS = 9 };
    const char* codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "AACP", "OPUS", "OGG", "VORBIS"};
    enum : int { ST_NONE = 0, ST_WEBFILE = 1, ST_WEBSTREAM = 2 };
    const char* streamTypeStr[3] = {"NONE", "WEBFILE", "WEBSTREAM"};
    typedef enum { LEFTCHANNEL = 0, RIGHTCHANNEL = 1 } SampleIndex;
    typedef enum { LOWSHELF = 0, PEAKEQ = 1, HIFGSHELF = 2 } FilterType;

  private:
    typedef struct _filter {
        float a0;
        float a1;
        float a2;
        float b1;
        float b2;
    } filter_t;

    typedef struct _pis_array {
        int number;
        int pids[4];
    } pid_array;

    File                m_audiofile;
    NetworkClient       client;
    NetworkClientSecure clientsecure;
    NetworkClient*      m_client = nullptr;

    SemaphoreHandle_t mutex_playAudioData;
    SemaphoreHandle_t mutex_audioTask;
    TaskHandle_t      m_audioTaskHandle = nullptr;

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-field-initializers"

    i2s_chan_handle_t m_i2s_tx_handle = {};
    i2s_chan_config_t m_i2s_chan_cfg = {}; // stores I2S channel values
    i2s_std_config_t  m_i2s_std_cfg = {};  // stores I2S driver values

#pragma GCC diagnostic pop

    std::vector<ps_ptr<char>> m_playlistContent; // m3u8 playlist buffer from responseHeader
    std::vector<ps_ptr<char>> m_playlistURL;     // m3u8 streamURLs buffer
    std::deque<ps_ptr<char>>  m_linesWithURL;    // extract from m_playlistContent, contains URL and MediaSequenceNumber
    std::vector<ps_ptr<char>> m_linesWithEXTINF; // extract from m_playlistContent, contains length and metadata
    std::vector<ps_ptr<char>> m_syltLines;       // SYLT line table
    std::vector<uint32_t>     m_syltTimeStamp;   // SYLT time table
    std::vector<uint32_t>     m_hashQueue;

    static const uint8_t m_tsPacketSize = 188;
    static const uint8_t m_tsHeaderSize = 4;

    std::unique_ptr<Decoder> m_decoder = {};
    ps_ptr<int16_t>          m_outBuff;        // Interleaved L/R
    ps_ptr<int16_t>          m_samplesBuff48K; // Interleaved L/R
    ps_ptr<char>             m_ibuff;          // used in log_info()
    ps_ptr<char>             m_lastHost;       // Store the last URL to a webstream
    ps_ptr<char>             m_currentHost;    // can be changed by redirection or playlist
    ps_ptr<char>             m_lastM3U8host;
    ps_ptr<char>             m_speechtxt;   // stores tts text
    ps_ptr<char>             m_streamTitle; // stores the last StreamTitle
    ps_ptr<char>             m_playlistBuff;

    filter_t       m_filter[3];             // digital filters
    const uint16_t m_plsBuffEntryLen = 256; // length of each entry in playlistBuff
    int            m_LFcount = 0;           // Detection of end of header
    uint32_t       m_sampleRate = 48000;
    uint32_t       m_avr_bitrate = 0;       // average bitrate, median calculated by VBR
    uint32_t       m_nominal_bitrate = 0;   // given br from header
    uint32_t       m_audioFilePosition = 0; // current position, counts every readed byte
    uint32_t       m_audioFileSize = 0;     // local and web files
    int            m_readbytes = 0;         // bytes read
    uint32_t       m_metacount = 0;         // counts down bytes between metadata
    int            m_controlCounter = 0;    // Status within readID3data() and readWaveHeader()
    int8_t         m_balance = 0;           // -16 (mute left) ... +16 (mute right)
    uint16_t       m_vol = 21;              // volume
    uint16_t       m_vol_steps = 21;        // default
    int16_t        m_inputHistory[6] = {0}; // used in resampleTo48kStereo()
    uint16_t       m_opus_mode = 0;         // celt_only, silk_only or hybrid
    double         m_limit_left = 0;        // limiter 0 ... 1, left channel
    double         m_limit_right = 0;       // limiter 0 ... 1, right channel
    uint8_t        m_timeoutCounter = 0;    // timeout counter
    uint8_t        m_curve = 0;             // volume characteristic
    uint8_t        m_bitsPerSample = 16;    // bitsPerSample
    uint8_t        m_channels = 2;

